Revit 2026 API

# PlumbingUtils Class

---

General utility methods in the Autodesk Revit MEP product.

SystemObject Autodesk.Revit.DB.PlumbingPlumbingUtils

**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class PlumbingUtils
```
```vb
Public NotInheritable Class PlumbingUtils
```
```cpp
public ref class PlumbingUtils abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type PlumbingUtils = class end
```

The PlumbingUtils type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | BreakCurve | Breaks the pipe curve into two parts at the given position. |
|  | ConnectPipePlaceholdersAtCross(Document, ElementId, ElementId) | Connects placeholders that looks like Cross connection. |
|  | ConnectPipePlaceholdersAtCross(Document, ElementId, ElementId, ElementId) | Connects placeholders that looks like Cross connection. |
|  | ConnectPipePlaceholdersAtCross(Document, Connector, Connector, Connector, Connector) | Connects placeholders that looks like Cross connection. |
|  | ConnectPipePlaceholdersAtElbow(Document, Connector, Connector) | Connects placeholders that looks like elbow connection. |
|  | ConnectPipePlaceholdersAtElbow(Document, ElementId, ElementId) | Connects placeholders that looks like elbow connection. |
|  | ConnectPipePlaceholdersAtTee(Document, ElementId, ElementId) | Connects two placeholders that looks like Tee connection. |
|  | ConnectPipePlaceholdersAtTee(Document, Connector, Connector, Connector) | Connects three placeholders that looks like Tee connection. |
|  | ConvertPipePlaceholders |  |
|  | HasOpenConnector | Checks if there is open piping connector for the given element - object of pipe curve, pipe fitting or pipe accessory. |
|  | PlaceCapOnOpenEnds | Places caps on the open connectors of the pipe curve, pipe fitting or pipe accessory. |

#### Reference

Autodesk.Revit.DB.Plumbing Namespace